app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new

    @today_posts = @user.books.where("created_at >= ?", Date.today)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2021-06-04 00:00:00"], ["created_at", "2021-06-04 23:59:59.999999"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "kazumaです"], ["profile_image_id", "d05047b382f1a55ae87f2c7d99ca35f21bf0a55d0a18e76e224d83f6078a"], ["updated_at", "2021-06-05 14:03:22.169841"], ["id", 2]]

  def following #フォローした人の一覧ページ(following)
    @title = "Follows"
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]